MobileInfoBase/src/Documents/Д_Доставка/Д_Доставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Д_Доставка</name>
  <comment>ДЗ-12-1-1</comment>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Д_СтатусыДоставок</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоДоставки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MobileInfoBase/src/InformationRegisters/Д_ФотоДоставок/Д_ФотоДоставок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Д_ФотоДоставок</name>
  <comment>mroc-diplom</comment>
  <resources>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Доставка</name>
    <type>
      <types>DocumentRef.Д_Доставка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

MobileInfoBase/src/Documents/Д_Доставка/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
// Володин А.А. 
// Задача 2 ДЗ Базовые подсистемы 
// 15 октября 2024 г.	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
// Конец вставки от 15 октября 2024 г.
//Начало Володин А.А. 29 октября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	ФотографияСсылка = "";
	
	ЗначениеКлюча = Новый Структура;
	ЗначениеКлюча.Вставить("Доставка", Объект.Ссылка);
	
	ЗаписьВРегистр = РегистрыСведений.Д_ФотоДоставок.СоздатьКлючЗаписи(ЗначениеКлюча);
	
	ФотографияСсылка = ПолучитьНавигационнуюСсылку(ЗаписьВРегистр, "Фотография", 0);
//Конец Володин А.А. 29 октября 2024 г.
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
// Володин А.А. 
// Задача 2 ДЗ Базовые подсистемы 
// 15 октября 2024 г.	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
// Конец вставки от 15 октября 2024 г.
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
// Володин А.А. 
// Задача 2 ДЗ Базовые подсистемы 
// 15 октября 2024 г.	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
// Конец вставки от 15 октября 2024 г.
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
// Володин А.А. 
// Задача 2 ДЗ Базовые подсистемы 
// 15 октября 2024 г.	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
// Конец вставки от 15 октября 2024 г.
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
//Начало Володин А.А. 27 октября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	МенеджерЗаписи = РегистрыСведений.Д_ФотоДоставок.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Доставка = Объект.Ссылка;
	
	Если ЭтоАдресВременногоХранилища(ФотографияСсылка) Тогда
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФотографияСсылка);
		
		МенеджерЗаписи.Фотография = Новый ХранилищеЗначения(ДвоичныеДанные); 
		МенеджерЗаписи.Записать();
		
	ИначеЕсли ФотографияСсылка = "" Тогда
		
		МенеджерЗаписи.Фотография = Новый ХранилищеЗначения(Неопределено);
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
//Конец Володин А.А. 29 октября 2024 г.
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
// Володин А.А. 
// Задача 2 ДЗ Базовые подсистемы 
// 15 октября 2024 г.
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
// Конец вставки от 15 октября 2024 г.
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
// Володин А.А. 
// Задача 2 ДЗ Базовые подсистемы 
// 15 октября 2024 г.
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
// Конец вставки от 15 октября 2024 г.
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
// Володин А.А. 
// Задача 2 ДЗ Базовые подсистемы 
// 15 октября 2024 г.
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
// Конец вставки от 15 октября 2024 г.
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
// Володин А.А. 
// Задача 2 ДЗ Базовые подсистемы 
// 15 октября 2024 г.
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
// Конец вставки от 15 октября 2024 г.
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
